snlkuharlocal/src/InformationRegisters/ДанныеЛогов/ДанныеЛогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЛогов</name>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаписей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоединения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИД_Записи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ДанныеЛогов/ManagerModule.bsl
Функция РазобратьПакет(Знач Строка) Экспорт
	Если СтрНачинаетсяС(Строка, ",") Тогда
		Строка = Сред(Строка, 2);		
	КонецЕсли;                                  
	
	Если СтрНачинаетсяС(Строка, "{") Тогда
		рРазбора = РазобратьПакетЖСОН(Строка);
	Иначе                                     
		рРазбора = РазобратьПакетТХТ(Строка);		
	КонецЕсли;  
	
	Возврат рРазбора;	
КонецФункции
	
Функция РазобратьПакетЖСОН(Строка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ТД 		= Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ВремяОбработки", ПолучитьОписаниеТиповЧисла(10, 3));
	
	Поля	= Новый Соответствие;	
	Для Каждого Кол Из ТД.Колонки Цикл		
		Поля[Кол.Имя] = Кол.Имя;
	КонецЦикла;
	
	Строка = "["+Строка+"]";
	
	Попытка			
		Данные = МаркировкаС.ПрочитатьИзСтрокиJSON(Строка, Тип("Массив"));	
		Для Каждого Запись Из Данные Цикл				
			Для Каждого КиЗ Из Запись Цикл
				Если Поля[КиЗ.Ключ] = Неопределено Тогда
					ТД.Колонки.Добавить(КиЗ.Ключ);					
					Поля[КиЗ.Ключ] = КиЗ.Ключ;
				КонецЕсли;				
			КонецЦикла;              
			СтрокаТД = ТД.Добавить();		
			
			ЗаполнитьЗначенияСвойств(СтрокаТД, Запись);
		КонецЦикла;
		Результат.Данные = ТД;
	Исключение
		Результат.Ошибки.Добавить(ОписаниеОшибки());		
	КонецПопытки;
	
	Результат.Успешно = (Результат.Ошибки.Количество()=0);
	
	Возврат Результат;	
КонецФункции // ()

Функция РазобратьПакетТХТ(Строка)
	Результат = МаркировкаКС.СтруктураРезультата();
	
	ТД 			= СоздатьТаблицуДанныхЛогов();	
	ТипЧисло	= ПолучитьОписаниеТиповЧисла(10,3);	
	
	Для Каждого Стр Из СтрРазделить(Строка, Символы.ПС) Цикл		
		Части = СтрРазделить(Стр, ";");
		//Сообщить(Части.ВГраница());
		Если Части.ВГраница()<5 Тогда Продолжить КонецЕсли;		
		
		СтрДаты = СтрЗаменить(Части[0],"-","");
		СтрДаты = СтрЗаменить(СтрДаты,":","");
		СтрДаты = СтрЗаменить(СтрДаты,"T","");		
		
		СтрокаТД = ТД.Добавить();
		
		СтрокаТД.ДатаЗаписи = Дата(СтрДаты);
		СтрокаТД.ИмяТаблицы = Части[2];		
		
		Если НЕ ПустаяСтрока(Части[3]) Тогда		
			УИД_Ссылки = Новый УникальныйИдентификатор(Части[3]);
			ЧастиТипа = СтрРазделить(СтрокаТД.ИмяТаблицы, ".");
			Если ЧастиТипа[0] = "Документ" Тогда		
				СтрокаТД.Ссылка = Документы[ЧастиТипа[1]].ПолучитьСсылку(УИД_Ссылки);
			ИначеЕсли ЧастиТипа[0] = "Справочник" Тогда		
				СтрокаТД.Ссылка = Справочники[ЧастиТипа[1]].ПолучитьСсылку(УИД_Ссылки);
			КонецЕсли;		
		КонецЕсли;			
		
		СтрокаТД.ВремяОбработки = ТипЧисло.ПривестиЗначение(Части[4]);
		СтрокаТД.ВесЗамера		= ТипЧисло.ПривестиЗначение(Части[5]);
		
		Если Части.ВГраница() > 5 Тогда
			ДопПоля = Новый Структура;
			Для Сч = 6 По Части.ВГраница() Цикл
				ТекСтрока = Части[Сч];
				Если СтрНачинаетсяС(ТекСтрока, "ДП_") Тогда
					ЧастиПоля = СтрРазделить(Сред(ТекСтрока,4), ":");
					Если ЧастиПоля.Количество() > 1 Тогда
						ДопПоля.Вставить(ЧастиПоля[0], ЧастиПоля[1]);											
					КонецЕсли;
				КонецЕсли;			
			КонецЦикла;
			
			СтрокаТД.РежимЗаписи = МаркировкаКС.ПолучитьЗначениеПараметра(ДопПоля, "РЗ");			
		КонецЕсли;		
	КонецЦикла;
	
	Результат.Данные = ТД;	
	Результат.Успешно = (Результат.Ошибки.Количество()=0);
	
	Возврат Результат;	
КонецФункции //РазобратьПакетТХТ(Строка)

Функция СоздатьТаблицуДанныхЛогов()
	Типы = Новый Массив;
	Для каждого Тип Из Документы.ТипВсеСсылки().Типы() Цикл
		Типы.Добавить(Тип);
	КонецЦикла; 
	Для каждого Тип Из Справочники.ТипВсеСсылки().Типы() Цикл
		Типы.Добавить(Тип);
	КонецЦикла;
	
	ТД 		= Новый ТаблицаЗначений;
	ТД.Колонки.Добавить("ДатаЗаписи", 		ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	ТД.Колонки.Добавить("ИмяТаблицы", 		ПолучитьОписаниеТиповСтроки(200));
	ТД.Колонки.Добавить("ВремяОбработки", 	ПолучитьОписаниеТиповЧисла(10, 3));             
	ТД.Колонки.Добавить("Ссылка", 			Новый ОписаниеТипов(Типы));
	ТД.Колонки.Добавить("Автор", 			Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТД.Колонки.Добавить("ВесЗамера",		ПолучитьОписаниеТиповЧисла(10));
	ТД.Колонки.Добавить("РежимЗаписи",		ПолучитьОписаниеТиповСтроки(20));

	Возврат ТД;
КонецФункции //СоздатьТаблицуДанныхЛогов()
